BusinessProcesses/СогласованиеВедомостиВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеВедомостиВыработки</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.СогласованиеВедомостиВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рецензент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСогласования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСогласования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/РезультатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РезультатыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыВедомостиВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыВедомостиВыработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/СогласованиеВедомостиВыработки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет строку с результатом согласования рецензента в тч РезультатыСогласования
//
// Параметры:
//	ТочкаМаршрута         - ТочкаМаршрутаБизнесПроцессаСсылка.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
//	Рецензент             - СправочникСсылка.Пользователи - исполнитель задачи по согласованию
//	РезультатСогласования - ПеречислениеСсылка.РезультатыСогласования
//	Комментарий           - Строка - комментарий рецензента
//	ДатаИсполнения        - Дата - дата выполнения задачи по согласованию рецензентом
//
Процедура ДобавитьРезультатСогласования(Знач ТочкаМаршрута,
	                                    Знач Рецензент,
	                                    Знач РезультатСогласования,
	                                    Знач Комментарий,
	                                    Знач ДатаИсполнения) Экспорт
	
	НоваяСтрока                       = РезультатыСогласования.Добавить();
	НоваяСтрока.ТочкаМаршрута         = ТочкаМаршрута;
	НоваяСтрока.Рецензент             = Рецензент;
	НоваяСтрока.РезультатСогласования = РезультатСогласования;
	НоваяСтрока.Комментарий           = Комментарий;
	НоваяСтрока.ДатаСогласования      = ДатаИсполнения;
	
	//Если БизнесПроцессы.СогласованиеЗаявкиНаВозвратТоваровОтКлиента.ИспользуетсяВерсионированиеПредмета(Предмет.Метаданные().ПолноеИмя()) Тогда
	//	НоваяСтрока.НомерВерсии = БизнесПроцессы.СогласованиеЗаявкиНаРасходованиеДенежныхСредств.НомерПоследнейВерсииПредмета(Ссылка);
	//КонецЕсли;
	//
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Дата согласования должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Дата согласования должна быть не меньше даты бизнес-процесса %Дата%';uk='Дата погодження повинна бути не менше дати бізнес-процесу %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Предмет) Тогда
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЫБОР
		                      |		КОГДА ЗаявкаНаРасходованиеСредств.Проведен
		                      |				И ЗаявкаНаРасходованиеСредств.Согласован
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК ЕстьОшибкиСогласован,
		                      |	ЗаявкаНаРасходованиеСредств.Ссылка КАК Предмет
		                      |ИЗ
		                      |	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
		                      |ГДЕ
		                      |	ЗаявкаНаРасходованиеСредств.Ссылка = &Предмет");
			
		Запрос.УстановитьПараметр("Предмет", Предмет);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		// Документ уже согласован - нет смысла начинать согласование
		Если Выборка.ЕстьОшибкиСогласован Тогда
			
			ТекстОшибки = НСтр("ru='%Предмет% не нуждается в согласовании';uk='%Предмет% не потребує погодження'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Предмет",
				,
				Отказ);
				
			Возврат;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьВыработки") Тогда
		ЗаполнитьБизнесПроцессНаОснованиВедомостиВыработки(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаНачала            = Дата(1,1,1);
	ДатаОкончания         = Дата(1,1,1);
	РезультатСогласования = Перечисления.РезультатыСогласования.ПустаяСсылка();
	ЕстьОтклоненияОтЛогистическихУсловий = Ложь;
	ЕстьОтклоненияОтФинансовыхУсловий    = Ложь;
	ЕстьОтклоненияОтЛогистическихУсловий = Ложь;
	
	РезультатыСогласования.Очистить();
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаНачала = ТекущаяДата();
	
	//Если НЕ ОбщегоНазначенияУТ.ПроверитьСогласующегоБизнесПроцесс(Справочники.РолиИсполнителей.СогласующийЗаявкиНаВозвратТоваровОтКлиентов) Тогда
	//	ТекстСообщения = НСтр("ru='Не указан %РольСогласующего';uk='Не зазначений %РольСогласующего'");
	//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%РольСогласующего", Справочники.РолиИсполнителей.СогласующийЗаявкиНаВозвратТоваровОтКлиентов);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//	Отказ = Истина;
	//КонецЕсли; 
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаЗавершения = ТекущаяДата();
	Об = Предмет.ПолучитьОбъект();
	
	Об.Статус  = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована;
КонецПроцедуры


Процедура ОбработкаРезультатовСогласованияОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПредметОбъект = Предмет.ПолучитьОбъект();
	
	// Документ уже согласован - ничего делать не требуется
	Если Не ПредметОбъект.ПометкаУдаления И Не (ПредметОбъект.Проведен И ПредметОбъект.Согласован) Тогда
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Предмет);
		Исключение
			
			ТекстОшибки = НСтр("ru='В ходе обработки результатов согласования не удалось заблокировать %Предмет%. %ОписаниеОшибки%';uk='У ході обробки результатів погодження не вдалося заблокувати %Предмет%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%",        Предмет);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение ТекстОшибки;
				
		КонецПопытки;
		
		ПредметОбъект.Согласован = Истина;
		Если ПредметОбъект.Статус = Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована Тогда
			ПредметОбъект.Статус = Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению;
			ПредметОбъект.ДатаСогласования = ТекущаяДата();
		КонецЕсли;
		
		Попытка
		
			ПредметОбъект.Записать(РежимЗаписиДокумента.Проведение);
			РазблокироватьДанныеДляРедактирования(Предмет);
			
		Исключение
			
			РазблокироватьДанныеДляРедактирования(Предмет);
			
			ТекстОшибки = НСтр("ru='Не удалось записать %Предмет%. %ОписаниеОшибки%';uk='Не вдалося записати %Предмет%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%",        Предмет);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки
		
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


Процедура ДокументСогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = (РезультатСогласования = Перечисления.РезультатыСогласования.Согласовано);
	
КонецПроцедуры

Процедура ОзнакомитьсяСРезультатамиПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	Задача.Исполнитель = Автор;
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура СогласоватьЗаявкуОбходнойЛистПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура ОзнакомитьсяСРезультатамиОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
	
КонецПроцедуры

Процедура СогласоватьДокументПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура СогласоватьДокументОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
	
КонецПроцедуры

Процедура ПодвестиИтогиСогласованияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура ПодвестиИтогиСогласованияОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

// Заполняет согласование на основании установки цен номенклатуры.
//
// Параметры
//	ДокументОснование - ДокументСсылка.ЗаказКлиента - Ссылка на заказ клиента
//
Процедура ЗаполнитьБизнесПроцессНаОснованиВедомостиВыработки(ДокументОснование)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВедомостьВыработки.Ссылка КАК Предмет,
	                      |	ВедомостьВыработки.Статус КАК Статус,
	                      |	НЕ ВедомостьВыработки.Проведен КАК ЕстьОшибкиПроведен,
	                      |	ВЫБОР
	                      |		КОГДА ВедомостьВыработки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВедомостиВыработки.НеСогласован)
	                      |				ИЛИ ВедомостьВыработки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВедомостиВыработки.Черновик)
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ КАК ЕстьОшибкиСтатус,
	                      |	ВедомостьВыработки.Подразделение КАК ЦФО
	                      |ИЗ
	                      |	Документ.ВедомостьВыработки КАК ВедомостьВыработки
	                      |ГДЕ
	                      |	ВедомостьВыработки.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

// Заполняет согласование заказа клиента в соответствии с отбором.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Структура со значениями отбора
//
Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Предмет") Тогда
		
		ТипПредмета = ТипЗнч(ДанныеЗаполнения.Предмет);
		
		Если ТипПредмета = Тип("ДокументСсылка.ВедомостьВыработки") Тогда
			ЗаполнитьБизнесПроцессНаОснованиВедомостиВыработки(ДанныеЗаполнения.Предмет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует согласование установки цен.
//
Процедура ИнициализироватьБизнесПроцесс()
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Создает и заполняет задачу исполнителя
//
// Параметры:
//	ТочкаМаршрутаБизнесПроцесса - ТочкаМаршрутаБизнесПроцессаСсылка.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
//
// Возвращаемое значение:
//	Созданная задача - ЗадачаОбъект.ЗадачаИсполнителя
//
Функция СоздатьЗадачу(Знач ТочкаМаршрутаБизнесПроцесса)
	
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	
	Задача.Дата                          = ТекущаяДата();
	Задача.Автор                         = Автор;
	Задача.Наименование                  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи;
	Задача.Описание                      = Наименование;
	Задача.Предмет                       = Предмет;
	Задача.Важность                      = Важность;
	Задача.РольИсполнителя               = ТочкаМаршрутаБизнесПроцесса.РольИсполнителя;
	
	Если  ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.СогласованиеВедомостиВыработки.ТочкиМаршрута.РуководительЦФО 
		или ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.СогласованиеВедомостиВыработки.ТочкиМаршрута.СогласованиеИнженер 
		Тогда
		//или ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.СогласованиеОбходногоЛиста.ТочкиМаршрута.МенеджерПоЛогистике  	
		Задача.ОсновнойОбъектАдресации       = ЦФО;
	//ИначеЕсли  ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.СогласованиеЗаявкиНаРасходованиеДенежныхСредств.ТочкиМаршрута.РуководительПроекта Тогда 
	//	Задача.ОсновнойОбъектАдресации       = Предмет.РасшифровкаПлатежа[0].Проект;		
	Иначе
		Задача.ОсновнойОбъектАдресации       = ТочкаМаршрутаБизнесПроцесса.ОсновнойОбъектАдресации;	
	КонецЕсли;
	Задача.ДополнительныйОбъектАдресации = ТочкаМаршрутаБизнесПроцесса.ДополнительныйОбъектАдресации;
	Задача.БизнесПроцесс                 = Ссылка;
	Задача.СрокИсполнения                = ДатаСогласования;
	Задача.ТочкаМаршрута                 = ТочкаМаршрутаБизнесПроцесса;
	
	Возврат Задача;

КонецФункции

Процедура УстановитьСтатусНаСогласованииОбработка(ТочкаМаршрутаБизнесПроцесса)
	УстановитьСтатусВедомостиВыработки(Перечисления.СтатусыВедомостиВыработки.НаСогласовании);
КонецПроцедуры

Процедура УстановитьСтатусВедомостиВыработки(Статус)
	ПредметОб        = ЭтотОбъект.Предмет.ПолучитьОбъект();
	ПредметОб.Статус = Статус;
	ПредметОб.Записать();
КонецПроцедуры
               

Функция ЗаявкаСогласована()  
	Возврат ЭтотОбъект.РезультатыСогласования[ЭтотОбъект.РезультатыСогласования.Количество()-1].РезультатСогласования = Перечисления.РезультатыСогласования.Согласовано;	
КонецФункции

Процедура УстановитьСтатусСогласованноОбработка(ТочкаМаршрутаБизнесПроцесса)
	УстановитьСтатусВедомостиВыработки(Перечисления.СтатусыВедомостиВыработки.Согласован);
КонецПроцедуры

Процедура УстановитьСтатусОтклоненаОбработка(ТочкаМаршрутаБизнесПроцесса)
	УстановитьСтатусВедомостиВыработки(Перечисления.СтатусыВедомостиВыработки.НеСогласован);
КонецПроцедуры

Процедура РезультатСогласованияРуководительПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЗаявкаСогласована();
КонецПроцедуры

Процедура РезультатДиректорДепартаментаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЗаявкаСогласована();
КонецПроцедуры

Процедура ПроверкаСогласования(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЗаявкаСогласована();
КонецПроцедуры

Процедура ДиректорДепартаментаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ЕстьРуководительЦФОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = не Предмет.Подразделение.ЦФОБезРуководителя;
КонецПроцедуры

Процедура ЕстьДиректорЦФОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = не Предмет.ЦФО.ЦФОБезДиректора;
КонецПроцедуры

Процедура ОтправитьПисьмоИнспекторПоКадрамОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обИнспекторПоКадрам);
	
КонецПроцедуры


Процедура ОтправитьПисьмоКладовщикЦФООбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обКладовщик);
	
КонецПроцедуры


Процедура ОтправитьПисьмоРуководительЦФООбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.анРуководительЦФО);
	
КонецПроцедуры


Процедура ОтправитьПисьмоМенеджерПоЛогистикеОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обМенеджерПоЛогистике);
	
КонецПроцедуры


Процедура ОтправитьПисьмоРуководительЛогистикиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обРуководительЛогистики);
	
КонецПроцедуры


Процедура ОтправитьПисьмоМенеджерИМОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обМенеджерИнтернетМагазина);
	
КонецПроцедуры


Процедура ОтправитьПисьмоСистемныйАдминистраторОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обСистемныйАдминистратор);
	
КонецПроцедуры


Процедура ОтправитьПисьмоБухгалтерТМЦОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обБухгалтерПоТМЦ);
	
КонецПроцедуры


Процедура ОтправитьПисьмоБухгалтерПоЗПОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обБухгалтерПоЗП);
	
КонецПроцедуры


Процедура ОтправитьПисьмоБухгалтерПоВзаиморасчетамОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обБухгалтерПоВзаиморасчетам);
	
КонецПроцедуры


Процедура ОтправитьПисьмоБухгалтерПоРеализациямОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.обБухгалтерПоРеализациям);
	
КонецПроцедуры


Процедура ОтправитьПисьмоФинансовыйКонтролерОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	vrgРазработкаКлиентСервер.ОбходнойЛистОтправитьПоПочте(Предмет,Справочники.РолиИсполнителей.анБюджетныйКонтролер);
	
КонецПроцедуры

Процедура РуководительЦФООбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	// Вставити вміст обробника.
КонецПроцедуры



#КонецОбласти

#КонецОбласти

#КонецЕсли
